test.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <ns3:add xmlns:ns2="http://www.openiam.org/service/types" xmlns:ns3="http://www.openiam.org/service/connector">
            <reqType>
                <requestID>Ra7a4f82ee5184ff4a7a1065c546e3c5a</requestID>
                <targetID>00000000433357c60143343d122d0e88</targetID>
                <hostUrl>LDAP://win02.ad.openiamdemo.info</hostUrl>
                <hostLoginId>AD\Administrator</hostLoginId>
                <hostLoginPassword>=tdWk2eqV8P</hostLoginPassword>
                <scriptHandler>ADPowershell.ps1</scriptHandler>
                <operation>ADD</operation>
                <extensibleObject>
                    <ns2:operation>0</ns2:operation>
                    <ns2:attributes>
                        <columnNbr>0</columnNbr>
                        <multiValued>false</multiValued>
                        <ns2:name>Name</ns2:name>
                        <ns2:value>R1JQX1dpdGhfTWVtYmVycw==</ns2:value>
                        <ns2:operation>1</ns2:operation>
                        <ns2:multivalued>false</ns2:multivalued>
                        <ns2:dataType>string</ns2:dataType>
                        <ns2:objectType>GROUP</ns2:objectType>
                    </ns2:attributes>
                    <ns2:attributes>
                        <columnNbr>0</columnNbr>
                        <multiValued>false</multiValued>
                        <ns2:name>SamAccountName</ns2:name>
                        <ns2:value>R1JQX1dpdGhfTWVtYmVycw==</ns2:value>
                        <ns2:operation>1</ns2:operation>
                        <ns2:multivalued>false</ns2:multivalued>
                        <ns2:dataType>string</ns2:dataType>
                        <ns2:objectType>GROUP</ns2:objectType>
                    </ns2:attributes>
                    <ns2:attributes>
                        <columnNbr>0</columnNbr>
                        <multiValued>false</multiValued>
                        <ns2:name>Members</ns2:name>
                        <ns2:operation>1</ns2:operation>
                        <ns2:multivalued>true</ns2:multivalued>
                        <ns2:valueList>Q049QURfR1JMMSxPVT1pZG0tdGVzdCxEQz1hZCxEQz1vcGVuaWFtZGVtbyxEQz1pbmZv
                        </ns2:valueList>
                        <ns2:dataType>string</ns2:dataType>
                        <ns2:objectType>GROUP</ns2:objectType>
                    </ns2:attributes>
                    <ns2:principalFieldName>SamAccountName</ns2:principalFieldName>
                    <ns2:principalFieldDataType>string</ns2:principalFieldDataType>
                    <ns2:extensibleObjectType>GROUP</ns2:extensibleObjectType>
                </extensibleObject>
                <objectIdentity>GRP_With_Members</objectIdentity>
            </reqType>
        </ns3:add>
    </soap:Body>
</soap:Envelope>